rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (director == 'George Lucas' and title != 'Star Wars')
---
  def similars_by_director
    @movie = Movie.find(params[:id])